# IntegerValue Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ElementId..::..IntegerValue Property
ElementId Class See Also
---
Provides the value of the element id as an integer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public int IntegerValue { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IntegerValue As Integer
	Get
```

Visual C++
---
```text
public:
property int IntegerValue {
	int get ();
}
```

# See Also
ElementId Class
Autodesk.Revit.DB Namespace